# ******************************************************************************
#   Программа parse.py находит URL-адреса в файлах, перечисленных в файле
# input.txt и подготавливает файл output.txt с исходными данными для дальнейше-
# го сбора информации по облигациям программой bonds.py.
#   Для запуска программы необходим Python 3.0
#   При выполнении в командной строке:
#   python3 parse.py
#                Copyright (c) 2020 Логинов М.Д.
#  Разработчик: Логинов М.Д.
#  Создан:        04 декабря 2020 г.
# ******************************************************************************


# ******************************************************************************
# Функция парсинга страниц bonds.finam.ru с результатами поиска облигаций, по-
# гашаемых или выкупаемых по оферте к некоторой дате. Результат - список отно-
# сительных URL.
# ******************************************************************************
def parse_file(fileName):
    f = open(fileName[:-1], 'r', encoding='cp1251')
    a = []
    for line in f:
        i = line.find('/issue/details')
        if i >= 0:
            if not (line[i:i+31] in a):
                a.append(line[i:i+31])
    f.close()
    return a


# ******************************************************************************
#                       Текст основной программы
# ******************************************************************************
listA = []
fileInput = open('input.txt', 'r')
for line in fileInput:
    listA = listA + parse_file(line)
fileInput.close()
fileOutput = open('output.txt', 'w')
for elem in listA:
    fileOutput.write('https://bonds.finam.ru' + elem + '\n')
fileOutput.close()
